MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1787/mcu.h
extern volatile DACCON0bits_t DACCON0bits __at(0x118);
// bitfield macros
#define _DACCON0_DACNSS_POSN                                0x0
#define _DACCON0_DACNSS_POSITION                            0x0
#define _DACCON0_DACNSS_SIZE                                0x1
#define _DACCON0_DACNSS_LENGTH                              0x1
#define _DACCON0_DACNSS_MASK                                0x1
#define _DACCON0_DACPSS0_POSN                               0x2
#define _DACCON0_DACPSS0_POSITION                           0x2
#define _DACCON0_DACPSS0_SIZE                               0x1
#define _DACCON0_DACPSS0_LENGTH                             0x1
#define _DACCON0_DACPSS0_MASK                               0x4
#define _DACCON0_DACPSS1_POSN                               0x3
#define _DACCON0_DACPSS1_POSITION                           0x3
#define _DACCON0_DACPSS1_SIZE                               0x1
#define _DACCON0_DACPSS1_LENGTH                             0x1
#define _DACCON0_DACPSS1_MASK                               0x8
#define _DACCON0_DACOE2_POSN                                0x4
#define _DACCON0_DACOE2_POSITION                            0x4
#define _DACCON0_DACOE2_SIZE                                0x1
#define _DACCON0_DACOE2_LENGTH                              0x1
#define _DACCON0_DACOE2_MASK                                0x10
#define _DACCON0_DACOE1_POSN                                0x5
#define _DACCON0_DACOE1_POSITION                            0x5
#define _DACCON0_DACOE1_SIZE                                0x1
#define _DACCON0_DACOE1_LENGTH                              0x1
#define _DACCON0_DACOE1_MASK                                0x20
#define _DACCON0_DACEN_POSN                                 0x7
#define _DACCON0_DACEN_POSITION                             0x7
#define _DACCON0_DACEN_SIZE                                 0x1
#define _DACCON0_DACEN_LENGTH                               0x1
#define _DACCON0_DACEN_MASK                                 0x80
#define _DACCON0_DACPSS_POSN                                0x2
#define _DACCON0_DACPSS_POSITION                            0x2
#define _DACCON0_DACPSS_SIZE                                0x2
#define _DACCON0_DACPSS_LENGTH                              0x2
#define _DACCON0_DACPSS_MASK                                0xC

// Register: DACCON1
#define DACCON1 DACCON1
extern volatile unsigned char           DACCON1             __at(0x119);
#ifndef _LIB_BUILD
asm("DACCON1 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
        unsigned DACR5                  :1;
        unsigned DACR6                  :1;
        unsigned DACR7                  :1;
    };
    struct {
        unsigned DACR                   :8;
    };
} DACCON1bits_t;
extern volatile DACCON1bits_t DACCON1bits __at(0x119);
// bitfield macros
#define _DACCON1_DACR0_POSN                                 0x0
#define _DACCON1_DACR0_POSITION                             0x0
#define _DACCON1_DACR0_SIZE                                 0x1
#define _DACCON1_DACR0_LENGTH                               0x1
#define _DACCON1_DACR0_MASK                                 0x1
#define _DACCON1_DACR1_POSN                                 0x1
#define _DACCON1_DACR1_POSITION                             0x1
#define _DACCON1_DACR1_SIZE                                 0x1
#define _DACCON1_DACR1_LENGTH                               0x1
#define _DACCON1_DACR1_MASK                                 0x2
#define _DACCON1_DACR2_POSN                                 0x2
#define _DACCON1_DACR2_POSITION                             0x2
#define _DACCON1_DACR2_SIZE                                 0x1
#define _DACCON1_DACR2_LENGTH                               0x1
#define _DACCON1_DACR2_MASK                                 0x4
#define _DACCON1_DACR3_POSN                                 0x3
#define _DACCON1_DACR3_POSITION                             0x3
#define _DACCON1_DACR3_SIZE                                 0x1
#define _DACCON1_DACR3_LENGTH                               0x1
#define _DACCON1_DACR3_MASK                                 0x8
#define _DACCON1_DACR4_POSN                                 0x4
#define _DACCON1_DACR4_POSITION                             0x4
#define _DACCON1_DACR4_SIZE                                 0x1
#define _DACCON1_DACR4_LENGTH                               0x1
#define _DACCON1_DACR4_MASK                                 0x10
#define _DACCON1_DACR5_POSN                                 0x5
#define _DACCON1_DACR5_POSITION                             0x5
#define _DACCON1_DACR5_SIZE                                 0x1
#define _DACCON1_DACR5_LENGTH                               0x1
#define _DACCON1_DACR5_MASK                                 0x20
#define _DACCON1_DACR6_POSN                                 0x6
#define _DACCON1_DACR6_POSITION                             0x6
#define _DACCON1_DACR6_SIZE                                 0x1
#define _DACCON1_DACR6_LENGTH                               0x1
#define _DACCON1_DACR6_MASK                                 0x40
#define _DACCON1_DACR7_POSN                                 0x7
#define _DACCON1_DACR7_POSITION                             0x7
#define _DACCON1_DACR7_SIZE                                 0x1
#define _DACCON1_DACR7_LENGTH                               0x1
#define _DACCON1_DACR7_MASK                                 0x80
#define _DACCON1_DACR_POSN                                  0x0
#define _DACCON1_DACR_POSITION                              0x0
#define _DACCON1_DACR_SIZE                                  0x8
#define _DACCON1_DACR_LENGTH                                0x8
#define _DACCON1_DACR_MASK                                  0xFF

// Register: CM4CON0
#define CM4CON0 CM4CON0
extern volatile unsigned char           CM4CON0             __at(0x11A);
#ifndef _LIB_BUILD
asm("CM4CON0 equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C4SYNC                 :1;
        unsigned C4HYS                  :1;
        unsigned C4SP                   :1;
        unsigned C4ZLF                  :1;
        unsigned C4POL                  :1;
        unsigned C4OE                   :1;
        unsigned C4OUT                  :1;
        unsigned C4ON                   :1;
    };
} CM4CON0bits_t;
extern volatile CM4CON0bits_t CM4CON0bits __at(0x11A);
// bitfield macros
#define _CM4CON0_C4SYNC_POSN                                0x0
#define _CM4CON0_C4SYNC_POSITION                            0x0
#define _CM4CON0_C4SYNC_SIZE                                0x1
#define _CM4CON0_C4SYNC_LENGTH                              0x1
#define _CM4CON0_C4SYNC_MASK                                0x1
#define _CM4CON0_C4HYS_POSN                                 0x1
#define _CM4CON0_C4HYS_POSITION                             0x1
#define _CM4CON0_C4HYS_SIZE                                 0x1
#define _CM4CON0_C4HYS_LENGTH                               0x1
#define _CM4CON0_C4HYS_MASK                                 0x2
#define _CM4CON0_C4SP_POSN                                  0x2
#define _CM4CON0_C4SP_POSITION                              0x2
#define _CM4CON0_C4SP_SIZE                                  0x1
#define _CM4CON0_C4SP_LENGTH                                0x1
#define _CM4CON0_C4SP_MASK                                  0x4
#define _CM4CON0_C4ZLF_POSN                                 0x3
#define _CM4CON0_C4ZLF_POSITION                             0x3
#define _CM4CON0_C4ZLF_SIZE                                 0x1
#define _CM4CON0_C4ZLF_LENGTH                               0x1
#define _CM4CON0_C4ZLF_MASK                                 0x8
#define _CM4CON0_C4POL_POSN                                 0x4
#define _CM4CON0_C4POL_POSITION                             0x4
#define _CM4CON0_C4POL_SIZE                                 0x1
#define _CM4CON0_C4POL_LENGTH                               0x1
#define _CM4CON0_C4POL_MASK                                 0x10
#define _CM4CON0_C4OE_POSN                                  0x5
#define _CM4CON0_C4OE_POSITION                              0x5
#define _CM4CON0_C4OE_SIZE                                  0x1
#define _CM4CON0_C4OE_LENGTH                                0x1
#define _CM4CON0_C4OE_MASK                                  0x20
#define _CM4CON0_C4OUT_POSN                                 0x6
#define _CM4CON0_C4OUT_POSITION                             0x6
#define _CM4CON0_C4OUT_SIZE                                 0x1
#define _CM4CON0_C4OUT_LENGTH                               0x1
#define _CM4CON0_C4OUT_MASK                                 0x40
#define _CM4CON0_C4ON_POSN                                  0x7
#define _CM4CON0_C4ON_POSITION                              0x7
#define _CM4CON0_C4ON_SIZE                                  0x1
#define _CM4CON0_C4ON_LENGTH                                0x1
#define _CM4CON0_C4ON_MASK                                  0x80

// Register: CM4CON1
#define CM4CON1 CM4CON1
extern volatile unsigned char           CM4CON1             __at(0x11B);
#ifndef _LIB_BUILD
asm("CM4CON1 equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C4NCH                  :3;
        unsigned C4PCH                  :3;
        unsigned C4INTN                 :1;
        unsigned C4INTP                 :1;
    };
    struct {
        unsigned C4NCH0                 :1;
        unsigned C4NCH1                 :1;
        unsigned C4NCH2                 :1;
        unsigned C4PCH0                 :1;
        unsigned C4PCH1                 :1;
        unsigned C4PCH2                 :1;
    };
} CM4CON1bits_t;
extern volatile CM4CON1bits_t CM4CON1bits __at(0x11B);
// bitfield macros
#define _CM4CON1_C4NCH_POSN                                 0x0
#define _CM4CON1_C4NCH_POSITION                             0x0
#define _CM4CON1_C4NCH_SIZE                                 0x3
#define _CM4CON1_C4NCH_LENGTH                               0x3
#define _CM4CON1_C4NCH_MASK                                 0x7
#define _CM4CON1_C4PCH_POSN                                 0x3
#define _CM4CON1_C4PCH_POSITION                             0x3
#define _CM4CON1_C4PCH_SIZE                                 0x3
#define _CM4CON1_C4PCH_LENGTH                               0x3
#define _CM4CON1_C4PCH_MASK                                 0x38
#define _CM4CON1_C4INTN_POSN                                0x6
#define _CM4CON1_C4INTN_POSITION                            0x6
#define _CM4CON1_C4INTN_SIZE                                0x1
#define _CM4CON1_C4INTN_LENGTH                              0x1
#define _CM4CON1_C4INTN_MASK                                0x40
#define _CM4CON1_C4INTP_POSN                                0x7
#define _CM4CON1_C4INTP_POSITION                            0x7
#define _CM4CON1_C4INTP_SIZE                                0x1
#define _CM4CON1_C4INTP_LENGTH                              0x1
#define _CM4CON1_C4INTP_MASK                                0x80
#define _CM4CON1_C4NCH0_POSN                                0x0
#define _CM4CON1_C4NCH0_POSITION                            0x0
#define _CM4CON1_C4NCH0_SIZE                                0x1
#define _CM4CON1_C4NCH0_LENGTH                              0x1
#define _CM4CON1_C4NCH0_MASK                                0x1
#define _CM4CON1_C4NCH1_POSN                                0x1
#define _CM4CON1_C4NCH1_POSITION                            0x1
#define _CM4CON1_C4NCH1_SIZE                                0x1
#define _CM4CON1_C4NCH1_LENGTH                              0x1
#define _CM4CON1_C4NCH1_MASK                                0x2
#define _CM4CON1_C4NCH2_POSN                                0x2
#define _CM4CON1_C4NCH2_POSITION                            0x2
#define _CM4CON1_C4NCH2_SIZE                                0x1
#define _CM4CON1_C4NCH2_LENGTH                              0x1
#define _CM4CON1_C4NCH2_MASK                                0x4
#define _CM4CON1_C4PCH0_POSN                                0x3
#define _CM4CON1_C4PCH0_POSITION                            0x3
#define _CM4CON1_C4PCH0_SIZE                                0x1
#define _CM4CON1_C4PCH0_LENGTH                              0x1
#define _CM4CON1_C4PCH0_MASK                                0x8
#define _CM4CON1_C4PCH1_POSN                                0x4
#define _CM4CON1_C4PCH1_POSITION                            0x4
#define _CM4CON1_C4PCH1_SIZE                                0x1
#define _CM4CON1_C4PCH1_LENGTH                              0x1
#define _CM4CON1_C4PCH1_MASK                                0x10
#define _CM4CON1_C4PCH2_POSN                                0x5
#define _CM4CON1_C4PCH2_POSITION                            0x5
#define _CM4CON1_C4PCH2_SIZE                                0x1
#define _CM4CON1_C4PCH2_LENGTH                              0x1
#define _CM4CON1_C4PCH2_MASK                                0x20

