MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1787/mcu.h
extern volatile PSMC1ASDCbits_t PSMC1ASDCbits __at(0x81D);
// bitfield macros
#define _PSMC1ASDC_P1ASDOV_POSN                             0x0
#define _PSMC1ASDC_P1ASDOV_POSITION                         0x0
#define _PSMC1ASDC_P1ASDOV_SIZE                             0x1
#define _PSMC1ASDC_P1ASDOV_LENGTH                           0x1
#define _PSMC1ASDC_P1ASDOV_MASK                             0x1
#define _PSMC1ASDC_P1ARSEN_POSN                             0x5
#define _PSMC1ASDC_P1ARSEN_POSITION                         0x5
#define _PSMC1ASDC_P1ARSEN_SIZE                             0x1
#define _PSMC1ASDC_P1ARSEN_LENGTH                           0x1
#define _PSMC1ASDC_P1ARSEN_MASK                             0x20
#define _PSMC1ASDC_P1ASDEN_POSN                             0x6
#define _PSMC1ASDC_P1ASDEN_POSITION                         0x6
#define _PSMC1ASDC_P1ASDEN_SIZE                             0x1
#define _PSMC1ASDC_P1ASDEN_LENGTH                           0x1
#define _PSMC1ASDC_P1ASDEN_MASK                             0x40
#define _PSMC1ASDC_P1ASE_POSN                               0x7
#define _PSMC1ASDC_P1ASE_POSITION                           0x7
#define _PSMC1ASDC_P1ASE_SIZE                               0x1
#define _PSMC1ASDC_P1ASE_LENGTH                             0x1
#define _PSMC1ASDC_P1ASE_MASK                               0x80

// Register: PSMC1ASDL
#define PSMC1ASDL PSMC1ASDL
extern volatile unsigned char           PSMC1ASDL           __at(0x81E);
#ifndef _LIB_BUILD
asm("PSMC1ASDL equ 081Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1ASDLA                :1;
        unsigned P1ASDLB                :1;
        unsigned P1ASDLC                :1;
        unsigned P1ASDLD                :1;
        unsigned P1ASDLE                :1;
        unsigned P1ASDLF                :1;
    };
} PSMC1ASDLbits_t;
extern volatile PSMC1ASDLbits_t PSMC1ASDLbits __at(0x81E);
// bitfield macros
#define _PSMC1ASDL_P1ASDLA_POSN                             0x0
#define _PSMC1ASDL_P1ASDLA_POSITION                         0x0
#define _PSMC1ASDL_P1ASDLA_SIZE                             0x1
#define _PSMC1ASDL_P1ASDLA_LENGTH                           0x1
#define _PSMC1ASDL_P1ASDLA_MASK                             0x1
#define _PSMC1ASDL_P1ASDLB_POSN                             0x1
#define _PSMC1ASDL_P1ASDLB_POSITION                         0x1
#define _PSMC1ASDL_P1ASDLB_SIZE                             0x1
#define _PSMC1ASDL_P1ASDLB_LENGTH                           0x1
#define _PSMC1ASDL_P1ASDLB_MASK                             0x2
#define _PSMC1ASDL_P1ASDLC_POSN                             0x2
#define _PSMC1ASDL_P1ASDLC_POSITION                         0x2
#define _PSMC1ASDL_P1ASDLC_SIZE                             0x1
#define _PSMC1ASDL_P1ASDLC_LENGTH                           0x1
#define _PSMC1ASDL_P1ASDLC_MASK                             0x4
#define _PSMC1ASDL_P1ASDLD_POSN                             0x3
#define _PSMC1ASDL_P1ASDLD_POSITION                         0x3
#define _PSMC1ASDL_P1ASDLD_SIZE                             0x1
#define _PSMC1ASDL_P1ASDLD_LENGTH                           0x1
#define _PSMC1ASDL_P1ASDLD_MASK                             0x8
#define _PSMC1ASDL_P1ASDLE_POSN                             0x4
#define _PSMC1ASDL_P1ASDLE_POSITION                         0x4
#define _PSMC1ASDL_P1ASDLE_SIZE                             0x1
#define _PSMC1ASDL_P1ASDLE_LENGTH                           0x1
#define _PSMC1ASDL_P1ASDLE_MASK                             0x10
#define _PSMC1ASDL_P1ASDLF_POSN                             0x5
#define _PSMC1ASDL_P1ASDLF_POSITION                         0x5
#define _PSMC1ASDL_P1ASDLF_SIZE                             0x1
#define _PSMC1ASDL_P1ASDLF_LENGTH                           0x1
#define _PSMC1ASDL_P1ASDLF_MASK                             0x20

// Register: PSMC1ASDS
#define PSMC1ASDS PSMC1ASDS
extern volatile unsigned char           PSMC1ASDS           __at(0x81F);
#ifndef _LIB_BUILD
asm("PSMC1ASDS equ 081Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P1ASDSC1               :1;
        unsigned P1ASDSC2               :1;
        unsigned P1ASDSC3               :1;
        unsigned P1ASDSC4               :1;
        unsigned                        :2;
        unsigned P1ASDSIN               :1;
    };
} PSMC1ASDSbits_t;
extern volatile PSMC1ASDSbits_t PSMC1ASDSbits __at(0x81F);
// bitfield macros
#define _PSMC1ASDS_P1ASDSC1_POSN                            0x1
#define _PSMC1ASDS_P1ASDSC1_POSITION                        0x1
#define _PSMC1ASDS_P1ASDSC1_SIZE                            0x1
#define _PSMC1ASDS_P1ASDSC1_LENGTH                          0x1
#define _PSMC1ASDS_P1ASDSC1_MASK                            0x2
#define _PSMC1ASDS_P1ASDSC2_POSN                            0x2
#define _PSMC1ASDS_P1ASDSC2_POSITION                        0x2
#define _PSMC1ASDS_P1ASDSC2_SIZE                            0x1
#define _PSMC1ASDS_P1ASDSC2_LENGTH                          0x1
#define _PSMC1ASDS_P1ASDSC2_MASK                            0x4
#define _PSMC1ASDS_P1ASDSC3_POSN                            0x3
#define _PSMC1ASDS_P1ASDSC3_POSITION                        0x3
#define _PSMC1ASDS_P1ASDSC3_SIZE                            0x1
#define _PSMC1ASDS_P1ASDSC3_LENGTH                          0x1
#define _PSMC1ASDS_P1ASDSC3_MASK                            0x8
#define _PSMC1ASDS_P1ASDSC4_POSN                            0x4
#define _PSMC1ASDS_P1ASDSC4_POSITION                        0x4
#define _PSMC1ASDS_P1ASDSC4_SIZE                            0x1
#define _PSMC1ASDS_P1ASDSC4_LENGTH                          0x1
#define _PSMC1ASDS_P1ASDSC4_MASK                            0x10
#define _PSMC1ASDS_P1ASDSIN_POSN                            0x7
#define _PSMC1ASDS_P1ASDSIN_POSITION                        0x7
#define _PSMC1ASDS_P1ASDSIN_SIZE                            0x1
#define _PSMC1ASDS_P1ASDSIN_LENGTH                          0x1
#define _PSMC1ASDS_P1ASDSIN_MASK                            0x80

// Register: PSMC1INT
#define PSMC1INT PSMC1INT
extern volatile unsigned char           PSMC1INT            __at(0x820);
#ifndef _LIB_BUILD
asm("PSMC1INT equ 0820h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1TPRIF                :1;
        unsigned P1TDCIF                :1;
        unsigned P1TPHIF                :1;
        unsigned P1TOVIF                :1;
        unsigned P1TPRIE                :1;
        unsigned P1TDCIE                :1;
        unsigned P1TPHIE                :1;
        unsigned P1TOVIE                :1;
    };
} PSMC1INTbits_t;
